# list  列表
type([1,2,3,4])  # list
# 列表，也可以是元祖类型的
[1,'hbb',True,[1,2,3]]

# 列表操作
len([1,2,3,4,5]) # 5

# 获取列表第几个 
[1,2,3,4,5][0]  # 1 
[1,2,3,4,5][4]  # 5 

# 截取列表的某一段,字符串的操作类似

[1,2,3,4,5][1:3]  # [2,3]
[1,2,3,4,5][1:7]  # [2,3,4,5]
[1,2,3,4,5][1:]  # [2,3,4,5]
[1,2,3,4,5][-4:] # [2,3,4,5]

# 更改列表某个元素  

[1,2]*3  #  重复三次
[1,2]+[3,4]  # [1,2,3,4]
arr = [1,2,3]
arr[1] = 4
print(arr)  # [1,4,3]

# 要删除list末尾的元素，用pop()方法
arr.pop()  # 3
print(arr) # [1,4]

arr = [1,2,3,4,5]
arr.pop(2)  # 删除下表2的列表元素

arr.pop(-1)  # 删除最后一个

arr.pop(-2)  # 删除倒数第二个